/**
 * @file		rm4_pinmux.h
 * @brief		Pin mux header file
 * @author		Lachlan Grogan
 * @copyright	This file contains proprietary and confidential information of
 *				SIL3 Pty. Ltd. (ACN 123 529 064). This code may be distributed
 *				under a license from SIL3 Pty. Ltd., and may be used, copied
 *				and/or disclosed only pursuant to the terms of that license agreement.
 *				This copyright notice must be retained as part of this file at all times.
 * @copyright	This file is copyright SIL3 Pty. Ltd. 2003-2016, All Rights Reserved.
 * @st_fileID	LCCM222R0.FILE.002
 */

#ifndef _RM4_PINMUX_H_
#define _RM4_PINMUX_H_

	#include <localdef.h>

	/* IOMM Revision and Boot Register */
	#define C_RM4PINMUX__REVISION_REG		(*(volatile Luint32 *)0xFFFFEA00U)
	#define C_RM4PINMUX__ENDIAN_REG		(*(volatile Luint32 *)0xFFFFEA20U)

	/* IOMM Error and Fault Registers */
	/** @struct iommErrFault
	*   @brief IOMM Error and Fault Register Definition
	*
	*   This structure is used to access the IOMM Error and Fault registers.
	*/
	typedef volatile struct iommErrFault
	{
		Luint32 ERR_RAW_STATUS_REG;          /* Error Raw Status / Set Register */
		Luint32 ERR_ENABLED_STATUS_REG;      /* Error Enabled Status / Clear Register */
		Luint32 ERR_ENABLE_REG;              /* Error Signaling Enable Register */
		Luint32 ERR_ENABLE_CLR_REG;          /* Error Signaling Enable Clear Register */
		Luint32  rsvd;                       /* Reserved */
		Luint32 FAULT_ADDRESS_REG;           /* Fault Address Register */
		Luint32 FAULT_STATUS_REG;            /* Fault Status Register */
		Luint32 FAULT_CLEAR_REG;             /* Fault Clear Register */
	} iommErrFault_t;
	/* Pinmux Register Frame Definition */
	/** @struct pinMuxKicker
	*   @brief Pin Muxing Kicker Register Definition
	*
	*   This structure is used to access the Pin Muxing Kicker registers.
	*/
	typedef volatile struct pinMuxKicker
	{
		Luint32 KICKER0;       /* kicker 0 register */
		Luint32 KICKER1;       /* kicker 1 register */
	} pinMuxKICKER_t;

	/** @struct pinMuxBase
	*   @brief PINMUX Register Definition
	*
	*   This structure is used to access the PINMUX module registers.
	*/
	/** @typedef pinMuxBASE_t
	*   @brief PINMUX Register Frame Type Definition
	*
	*   This type is used to access the PINMUX Registers.
	*/
	typedef volatile struct pinMuxBase
	{
		Luint32 PINMMR0;		/**< 0xEB10 Pin Mux 0 register*/
		Luint32 PINMMR1;		/**< 0xEB14 Pin Mux 1 register*/
		Luint32 PINMMR2;		/**< 0xEB18 Pin Mux 2 register*/
		Luint32 PINMMR3;		/**< 0xEB1C Pin Mux 3 register*/
		Luint32 PINMMR4;		/**< 0xEB20 Pin Mux 4 register*/
		Luint32 PINMMR5;		/**< 0xEB24 Pin Mux 5 register*/
		Luint32 PINMMR6;		/**< 0xEB28 Pin Mux 6 register*/
		Luint32 PINMMR7;		/**< 0xEB2C Pin Mux 7 register*/
		Luint32 PINMMR8;		/**< 0xEB30 Pin Mux 8 register*/
		Luint32 PINMMR9;		/**< 0xEB34 Pin Mux 9 register*/
		Luint32 PINMMR10;		/**< 0xEB38 Pin Mux 10 register*/
		Luint32 PINMMR11;		/**< 0xEB3C Pin Mux 11 register*/
		Luint32 PINMMR12;		/**< 0xEB40 Pin Mux 12 register*/
		Luint32 PINMMR13;		/**< 0xEB44 Pin Mux 13 register*/
		Luint32 PINMMR14;		/**< 0xEB48 Pin Mux 14 register*/
		Luint32 PINMMR15;		/**< 0xEB4C Pin Mux 15 register*/
		Luint32 PINMMR16;		/**< 0xEB50 Pin Mux 16 register*/
		Luint32 PINMMR17;		/**< 0xEB54 Pin Mux 17 register*/
		Luint32 PINMMR18;		/**< 0xEB58 Pin Mux 18 register*/
		Luint32 PINMMR19;		/**< 0xEB5C Pin Mux 19 register*/
		Luint32 PINMMR20;		/**< 0xEB60 Pin Mux 20 register*/
		Luint32 PINMMR21;		/**< 0xEB64 Pin Mux 21 register*/
		Luint32 PINMMR22;		/**< 0xEB68 Pin Mux 22 register*/
		Luint32 PINMMR23;		/**< 0xEB6C Pin Mux 23 register*/
		Luint32 PINMMR24;		/**< 0xEB70 Pin Mux 24 register*/
		Luint32 PINMMR25;		/**< 0xEB74 Pin Mux 25 register*/
		Luint32 PINMMR26;		/**< 0xEB78 Pin Mux 26 register*/
		Luint32 PINMMR27;		/**< 0xEB7C Pin Mux 27 register*/
		Luint32 PINMMR28;		/**< 0xEB80 Pin Mux 28 register*/
		Luint32 PINMMR29;		/**< 0xEB84 Pin Mux 29 register*/
		Luint32 PINMMR30;		/**< 0xEB88 Pin Mux 30 register*/
	}pinMuxBASE_t;


	/** @def iommErrFaultReg
	*       @brief IOMM Error Fault Register Frame Pointer
	*
	*               This pointer is used to control IOMM Error and Fault across the device.
	*/
	#define iommErrFaultReg ((iommErrFault_t *) 0xFFFFEAE0U)

	/** @def kickerReg
	*	@brief Pin Muxing Kicker Register Frame Pointer
	*
	*		This pointer is used to enable and disable muxing accross the device.
	*/
	#define kickerReg ((pinMuxKICKER_t *) 0xFFFFEA38U)

	/** @def pinMuxReg
	*	@brief Pin Muxing Control Register Frame Pointer
	*
	*		This pointer is used to set the muxing registers accross the device.
	*/
	#define pinMuxReg ((pinMuxBASE_t *) 0xFFFFEB10U)


	//defines
	#define PINMUX_BALL_A5_SHIFT	8U
	#define PINMUX_BALL_A11_SHIFT	8U
	#define PINMUX_BALL_A14_SHIFT	0U
	#define PINMUX_BALL_B2_SHIFT	24U
	#define PINMUX_BALL_B3_SHIFT	8U
	#define PINMUX_BALL_B4_SHIFT	16U
	#define PINMUX_BALL_B5_SHIFT	24U
	#define PINMUX_BALL_B6_SHIFT	8U
